In [2]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
 'key2' : ['one', 'two', 'one', 'two', 'one'],
 'data1' : np.random.randn(5),
 'data2' : np.random.randn(5)})

In [6]:
df

  key1 key2     data1     data2
0    a  one  1.047228  0.474897
1    a  two -1.799564 -1.389404
2    b  one -0.528737 -0.372097
3    b  two  2.579401 -0.504186
4    a  one  0.549642  0.871034

In [7]:
grouped = df['data1'].groupby(df['key1'])

In [8]:
grouped

In [9]:
grouped.mean()

key1
a   -0.067565
b    1.025332
Name: data1, dtype: float64

In [11]:
means= df['data1'].groupby([df['key1'],df['key2']]).mean()

In [12]:
means

key1  key2
a     one     0.798435
      two    -1.799564
b     one    -0.528737
      two     2.579401
Name: data1, dtype: float64

In [13]:
means.unstack()

key2       one       two
key1
a     0.798435 -1.799564
b    -0.528737  2.579401

In [14]:
states=np.array(['Ohio','California','California','Ohio','Ohio'])

In [15]:
years =np.array([2005,2005,2006,2005,2006])

In [16]:
df['data1'].groupby([states,years]).mean()

California  2005   -1.799564
            2006   -0.528737
Ohio        2005    1.813314
            2006    0.549642
Name: data1, dtype: float64

In [17]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.067565 -0.014491
b     1.025332 -0.438142

In [18]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.798435  0.672966
     two  -1.799564 -1.389404
b    one  -0.528737 -0.372097
     two   2.579401 -0.504186

In [19]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [22]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  1.047228  0.474897
1    a  two -1.799564 -1.389404
4    a  one  0.549642  0.871034
b
  key1 key2     data1     data2
2    b  one -0.528737 -0.372097
3    b  two  2.579401 -0.504186

In [24]:
 for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  1.047228  0.474897
4    a  one  0.549642  0.871034
('a', 'two')
  key1 key2     data1     data2
1    a  two -1.799564 -1.389404
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.528737 -0.372097
('b', 'two')
  key1 key2     data1     data2
3    b  two  2.579401 -0.504186

In [25]:
 pieces = dict(list(df.groupby('key1')))

In [26]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.528737 -0.372097
3    b  two  2.579401 -0.504186

In [27]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [29]:
grouped = df.groupby(df.dtypes,axis=1)

In [31]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  1.047228  0.474897
1 -1.799564 -1.389404
2 -0.528737 -0.372097
3  2.579401 -0.504186
4  0.549642  0.871034
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [35]:
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [36]:
 df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.672966
     two  -1.389404
b    one  -0.372097
     two  -0.504186

In [37]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [38]:
 s_grouped

In [39]:
 s_grouped.mean()

key1  key2
a     one     0.672966
      two    -1.389404
b     one    -0.372097
      two    -0.504186
Name: data2, dtype: float64

In [40]:
people = pd.DataFrame(np.random.randn(5, 5),
....: columns=['a', 'b', 'c', 'd', 'e'],
....: index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [41]:
people.iloc[2:3, [1, 2]] = np.nan

In [42]:
people

               a         b         c         d         e
Joe     0.379039  1.702496  0.127889 -0.981371 -1.219110
Steve   0.014866  0.232392  0.294075  0.186784  0.206366
Wes     1.847579       NaN       NaN -0.783364  0.379191
Jim    -0.906951 -0.696670  0.872305 -1.567793  0.498964
Travis -0.778048  1.591631 -0.188550 -0.270779  1.059079

In [43]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue','d': 'blue', 'e': 'red', 'f' : 'orange'}

In [44]:
by_column = people.groupby(mapping, axis=1)

In [45]:
by_column.sum()

            blue       red
Joe    -0.853482  0.862425
Steve   0.480859  0.453624
Wes    -0.783364  2.226771
Jim    -0.695488 -1.104657
Travis -0.459328  1.872662

In [46]:
map_series = pd.Series(mapping)

In [47]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [48]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [49]:
people.groupby(len).sum()

          a         b         c         d         e
3  1.319668  1.005826  1.000193 -3.332528 -0.340954
5  0.014866  0.232392  0.294075  0.186784  0.206366
6 -0.778048  1.591631 -0.188550 -0.270779  1.059079

In [50]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [51]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.379039  1.702496  0.127889 -0.981371 -1.219110
  two -0.906951 -0.696670  0.872305 -1.567793  0.498964
5 one  0.014866  0.232392  0.294075  0.186784  0.206366
6 two -0.778048  1.591631 -0.188550 -0.270779  1.059079

In [52]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],[1, 3, 5, 1, 3]],names=['cty', 'tenor'])

In [53]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [54]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.684965 -0.419654 -0.738356  0.079388  0.943255
1      0.208222 -0.763341 -0.630874  0.148437  0.690334
2     -1.248935  0.180136  0.768849 -0.306543 -1.224726
3     -0.345090  0.714195  2.536796 -0.129499  1.515888

In [55]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [56]:
 df

  key1 key2     data1     data2
0    a  one  1.047228  0.474897
1    a  two -1.799564 -1.389404
2    b  one -0.528737 -0.372097
3    b  two  2.579401 -0.504186
4    a  one  0.549642  0.871034

In [57]:
grouped = df.groupby('key1')

In [58]:
grouped['data1'].quantile(0.9)

key1
a    0.947710
b    2.268587
Name: data1, dtype: float64

In [59]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [60]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     2.846792  2.260438
b     3.108137  0.132089

In [61]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.067565  1.520449 -1.799564 -0.624961  0.549642  0.798435
b      2.0  1.025332  2.197785 -0.528737  0.248298  1.025332  1.802366

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.047228   3.0 -0.014491  1.207071 -1.389404 -0.457253  0.474897
b     2.579401   2.0 -0.438142  0.093401 -0.504186 -0.471164 -0.438142


           75%       max
key1
a     0.672966  0.871034
b    -0.405119 -0.372097

In [62]:
tips = pd.read_csv('tips.csv')

In [63]:
tips[:8]

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4
5       25.29  4.71     No  Sun  Dinner     4
6        8.77  2.00     No  Sun  Dinner     2
7       26.88  3.12     No  Sun  Dinner     4

In [64]:
 grouped = tips.groupby(['day', 'smoker'])

In [66]:
grouped_pct = grouped['tip_pct']

KeyError: 'Column not found: tip_pct'

In [67]:
 grouped_pct.agg('mean')

NameError: name 'grouped_pct' is not defined

ModuleNotFoundError: No module named 'tip_pct'

In [70]:
def top(df, n=5, column='tip_pct'):
     
        return df.sort_values(by=column)[-n:]

In [71]:
top(tips, n=6)

KeyError: 'tip_pct'